Tekla Open API Reference for Tekla Structures 2025
Polymesh.Validate Method
 Converts a
FacetedBrep
 to a polymesh and validates.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool Validate(
	FacetedBrep brep,
	Polymesh.PolymeshCheckerFlags checkCriteria,
	ref List<KeyValuePair<int, Polymesh.PolymeshHealthCheckEnum>> invalidInfo
)
Public Shared Function Validate (
	brep As FacetedBrep,
	checkCriteria As Polymesh.PolymeshCheckerFlags,
	ByRef invalidInfo As List(Of KeyValuePair(Of Integer, Polymesh.PolymeshHealthCheckEnum))
) As Boolean
Parameters
brep
Type: Tekla.Structures.Geometry3d.FacetedBrep
The FacetedBrep to be converted and validated
checkCriteria
Type: Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags
The flags to indicate what to check
invalidInfo
Type: System.Collections.Generic.List<KeyValuePair<Int32, Polymesh.PolymeshHealthCheckEnum>>
The problematic faces' indices and their failed reasons, (-1, PolymeshUndefined) is for unknown reason for uncertain face. No inner loops checked further if outer loop found error.
Return Value
Type: Boolean
True if valid, false if error found
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace